---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.ShapeMismatch
enum: Autodesk.Revit.DB.Fabrication.FabricationPartFitResult
source: html/36a9c1b4-343e-c0ce-fd27-8b42b8a82288.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.ShapeMismatch

Failed due to shape mismatch of fitting ends.